Documents/РеализацияАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РеализацияАссортимента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатур</xr:Item>
				<xr:Item>AccumulationRegister.РасходыИПродажиНаТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ингредиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияОРецептуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОРецептуре</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ингредиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РеализацияАссортимента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ВыполнитьЗаполнениеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ВыполнитьЗаполнениеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеОстатков() Экспорт
	
	СтруктураОстатков = Новый Соответствие();
	СтруктураЕдиницИзмерения = Новый Соответствие();
	Объект.Остатки.Очистить();
		
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Товар", Объект.Товар);
		
	Для Каждого СтрокаРецепта Из ТаблицаРецептур.НайтиСтроки(ПараметрыОтбора) Цикл
		Если СтруктураОстатков.Получить(СтрокаРецепта.Ингредиент) = Неопределено Тогда
			СтруктураОстатков.Вставить(СтрокаРецепта.Ингредиент, СтрокаРецепта.Количество * Объект.Количество);
		Иначе
			СтруктураОстатков[СтрокаРецепта.Ингредиент] = СтруктураОстатков[СтрокаРецепта.Ингредиент] + (СтрокаРецепта.Количество * Объект.Количество);
		КонецЕсли;
		
		СтруктураЕдиницИзмерения.Вставить(СтрокаРецепта.Ингредиент, СтрокаРецепта.ВидЕдиницыИзмерения);
	КонецЦикла;
	
	
	Для Каждого СтрокаОстатки Из СтруктураОстатков Цикл
		Стр = Объект.Остатки.Добавить();
		Стр.Ингредиент = СтрокаОстатки.Ключ;
		Стр.Количество = СтрокаОстатки.Значение;
		Стр.ВидЕдиницыИзмерения = СтруктураЕдиницИзмерения.Получить(СтрокаОстатки.Ключ);
		Стр.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[Стр.ВидЕдиницыИзмерения];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Регистр.Товар КАК Товар,
	|	Регистр.Ингредиент КАК Ингредиент,
	|	Регистр.Количество КАК Количество,
	|	Номенклатура.ВидЕдиницыИзмерения КАК ВидЕдиницыИзмерения
	|ИЗ
	|	РегистрСведений.СведенияОРецептуре КАК Регистр
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ПО
	|	Регистр.Ингредиент = Номенклатура.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		РецептураНаборЗаписей = РезультатЗапроса.Выбрать();	
		
		Пока РецептураНаборЗаписей.Следующий() Цикл
			СтрокаТабЧасти = ТаблицаРецептур.Добавить();
			СтрокаТабЧасти.Товар = РецептураНаборЗаписей.Товар;
			СтрокаТабЧасти.Ингредиент = РецептураНаборЗаписей.Ингредиент;
			СтрокаТабЧасти.Количество = РецептураНаборЗаписей.Количество;
			СтрокаТабЧасти.ВидЕдиницыИзмерения = РецептураНаборЗаписей.ВидЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	СтандартныеЕдиницыИзмерения = ПараметрыСеанса.СтандартныеЕдиницыИзмерения;
	
КонецПроцедуры
